In [1]:
import pandas as pd
import numpy as np
import scipy
from scipy import stats
from scipy.stats import percentileofscore
from scipy.stats import zscore

In [2]:
sm=pd.read_csv('student_marks.csv')
sm.head()

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
0,John,M,05-04-1988,55,45,56,87,21,52,89,65
1,Suresh,M,04-05-1987,75,96,78,64,90,61,58,2
2,Ramesh,M,25-05-1989,25,54,89,76,95,87,56,74
3,Jessica,F,12-08-1990,78,96,86,63,54,89,75,45
4,Jennifer,F,02-09-1989,58,96,78,46,96,77,83,53

In [3]:
sm['Maths'].mean()

59.6

In [4]:
sm['Physics'].mean()

72.3

In [5]:
sm['English'].mean()

69.7

In [6]:
print(sm['Maths'].median())
print(sm['Physics'].median())
print(sm['English'].median())

55.0
70.0
69.5

In [7]:
print(percentileofscore (sm['Maths'],25))
print(percentileofscore (sm['Physics'],50))
print(percentileofscore (sm['English'],75))

10.0
20.0
60.0

## .quantile function is used to find the percentile in Pandas

In [8]:
q1=sm['Maths'].quantile(0.25) # 25th percentile
q1

54.25

In [9]:
q2=sm['Physics'].quantile(0.50) # 50 percentile also known as Median
q2

70.0

In [10]:
q3=sm['English'].quantile(.75) # 75th percentile
q3

81.25

In [11]:
IQR=q3-q1 # IQR is inter-quartile range (75th-25th)
IQR

27.0

In [12]:
sm['Maths'].var() # variance

378.71111111111105

In [13]:
print(sm['Maths'].var()) # variance
print(sm['Maths'].std()) # std deviation
print(sm['Physics'].var())
print(sm['Physics'].std())
print(sm['English'].var())
print(sm['English'].std())

378.71111111111105
19.46050130677807
426.8999999999999
20.661558508495915
208.89999999999998
14.453373308677804

In [14]:
sm.describe() # gives 8-fig summary

,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
count,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.0000
mean,59.600000,72.300000,75.300000,69.700000,64.700000,72.700000,69.700000,60.5000
std,19.460501,20.661559,14.000397,14.453373,26.998148,14.629119,14.453373,25.3432
min,25.000000,45.000000,52.000000,46.000000,21.000000,52.000000,46.000000,2.0000
25%,54.250000,56.250000,65.000000,59.250000,54.250000,58.750000,59.250000,52.2500
50%,55.000000,70.000000,78.000000,69.500000,66.500000,76.000000,69.500000,63.0000
75%,70.750000,93.750000,86.750000,81.250000,87.000000,86.000000,81.250000,76.2500
max,96.000000,96.000000,89.000000,89.000000,96.000000,89.000000,89.000000,89.0000

In [15]:
zscore([56,34,31,33])

array([ 1.72223741, -0.44286105, -0.73810175, -0.54127461])

In [16]:
sm.iloc[:,3:-1] # select specific column for the dataset; # :,: = rows,column

   Maths  Physics  Chemistry  English  Biology  Economics  History
0     55       45         56       87       21         52       89
1     75       96         78       64       90         61       58
2     25       54         89       76       95         87       56
3     78       96         86       63       54         89       75
4     58       96         78       46       96         77       83
5     45       87         52       89       55         89       87
6     55       64         61       58       75         58       64
7     54       76         87       56       25         56       76
8     55       63         89       75       78         75       63
9     96       46         77       83       58         83       46

In [17]:
sm.describe()

,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
count,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.0000
mean,59.600000,72.300000,75.300000,69.700000,64.700000,72.700000,69.700000,60.5000
std,19.460501,20.661559,14.000397,14.453373,26.998148,14.629119,14.453373,25.3432
min,25.000000,45.000000,52.000000,46.000000,21.000000,52.000000,46.000000,2.0000
25%,54.250000,56.250000,65.000000,59.250000,54.250000,58.750000,59.250000,52.2500
50%,55.000000,70.000000,78.000000,69.500000,66.500000,76.000000,69.500000,63.0000
75%,70.750000,93.750000,86.750000,81.250000,87.000000,86.000000,81.250000,76.2500
max,96.000000,96.000000,89.000000,89.000000,96.000000,89.000000,89.000000,89.0000